[
  {
    "q": "Though she rarely misses a sunrise on weekdays, she sleeps in on Sundays unless a mountain hike is planned.",
    "s-": "She never wakes up early, not even on weekdays, because she always sleeps in on Sundays.",
    "s+": "On most weekdays she rises for sunrise, but on Sundays she sleeps late—except when a mountain hike is scheduled."
  },
  {
    "q": "If the concert isn't canceled, Leo will arrive late only if the subway is delayed, which it seldom is on holidays.",
    "s-": "Leo is guaranteed to be late for the concert on holidays because the subway always delays him.",
    "s+": "Provided the concert goes on, Leo will be late only when the subway runs behind schedule—an uncommon occurrence on holidays."
  },
  {
    "q": "Mira promised to submit the draft after the meeting she rescheduled, not the one she skipped last week.",
    "s-": "Mira will submit the draft after the meeting she skipped last week.",
    "s+": "She'll turn in the draft following the meeting she rescheduled, rather than the one she missed previously."
  },
  {
    "q": "The lab reported that the catalyst increases yield unless humidity exceeds 70%, in which case results degrade rapidly.",
    "s-": "Higher humidity always improves the catalyst's yield according to the lab report.",
    "s+": "According to the lab, the catalyst boosts yield, but when humidity rises above 70% the performance drops quickly."
  },
  {
    "q": "He writes reviews under a pen name his editor knows but his readers don't, even when topics are controversial.",
    "s-": "Everyone, including his readers, knows his real identity whenever he writes controversial reviews.",
    "s+": "He publishes reviews using a pseudonym recognized by his editor yet unknown to readers, including for contentious topics."
  },
  {
    "q": "Only the interns who finished both simulations—and not those who finished merely one—can access the robotics lab.",
    "s-": "Any intern who completed at least one simulation can access the robotics lab.",
    "s+": "Access to the robotics lab is restricted to interns who completed both simulations; finishing just one isn't enough."
  },
  {
    "q": "Unless the archive server times out, the script fetches the oldest snapshot that still contains the missing table.",
    "s-": "The script always retrieves the newest snapshot, even when the server doesn't time out.",
    "s+": "Barring a server timeout, the script selects the oldest snapshot that still includes the missing table."
  },
  {
    "q": "Nadia enjoys texts that are concise if rigorous, rather than verbose pieces that sound precise but say little.",
    "s-": "Nadia prefers verbose writing because it always feels more rigorous to her.",
    "s+": "She favors concise yet rigorous texts over long-winded ones that merely sound precise while conveying little."
  },
  {
    "q": "He said the solution might not be elegant, but it would be correct unless we misunderstood the constraints.",
    "s-": "He guaranteed the solution was elegant and correct regardless of the constraints.",
    "s+": "He warned that the method might lack elegance, though it should be correct provided we hadn't misread the constraints."
  },
  {
    "q": "The botanist identified the flower whose petals, not its leaves, contain the pigment that changes with soil pH.",
    "s-": "The botanist said the leaves, not the petals, contain the pigment responsive to soil pH.",
    "s+": "She determined that the pigment sensitive to soil pH resides in the petals rather than the leaves."
  },
  {
    "q": "After the firmware rollback—requested by security, not operations—the routers finally stopped dropping packets.",
    "s-": "Operations requested the rollback, and after it the routers kept dropping packets.",
    "s+": "Security requested the firmware rollback, and following it the routers ceased dropping packets."
  },
  {
    "q": "Those who said the dataset was 'nearly balanced' were, if anything, understating the skew in the minority classes.",
    "s-": "The dataset is perfectly balanced, so there is no skew in the minority classes at all.",
    "s+": "Calling the dataset 'nearly balanced' actually downplayed how skewed the minority classes are."
  },
  {
    "q": "She'll bake either the citrus tart or the plum galette, but not both, unless extra guests show up unexpectedly.",
    "s-": "She plans to bake both desserts regardless of how many guests arrive.",
    "s+": "She intends to make one dessert—either the citrus tart or the plum galette—and only make both if surprise guests appear."
  },
  {
    "q": "The committee endorsed the proposal that the junior members drafted, which the chair had initially dismissed.",
    "s-": "The chair authored the endorsed proposal, while the juniors' draft was rejected.",
    "s+": "They approved the juniors' proposal—the very one the chair first turned down."
  },
  {
    "q": "Despite the headline suggesting otherwise, the study found no causal link, only a correlation sensitive to outliers.",
    "s-": "The study firmly established a causal link that remained strong even after removing outliers.",
    "s+": "Contrary to the headline, the study reported merely a correlation that weakens when outliers are handled."
  },
  {
    "q": "He promised to call his aunt after emailing his advisor about the grant, not before writing the report summary.",
    "s-": "He will call his aunt before he writes the report summary and prior to emailing his advisor.",
    "s+": "He'll phone his aunt once he has emailed his advisor regarding the grant; this happens after, not before, the report summary."
  },
  {
    "q": "Only when the batteries were replaced did the clock, which had been slow for weeks, start keeping accurate time.",
    "s-": "Replacing the batteries made no difference; the clock remained slow for weeks afterward.",
    "s+": "The clock had been running slow for weeks, and accuracy returned only after the batteries were replaced."
  },
  {
    "q": "If any author deserves the prize, it's Lin, whose second novel—unlike the debut—sustains its risky structure.",
    "s-": "Lin's debut sustained a risky structure, so the second novel fails to do so and doesn't deserve a prize.",
    "s+": "Lin merits the prize because the second novel, in contrast to the debut, maintains its daring structure throughout."
  },
  {
    "q": "Because the keynote was overbooked, guests who didn't pre-register could attend only if a seat opened at the door.",
    "s-": "Even without pre-registering, every guest was guaranteed a seat at the keynote.",
    "s+": "Due to overbooking, walk-ins were admitted solely when a seat became available at the entrance."
  },
  {
    "q": "The chef served the pasta with the truffle oil she imported, rather than the local bottle that had gone stale.",
    "s-": "She used the stale local truffle oil instead of the imported one for the pasta.",
    "s+": "She dressed the pasta with her imported truffle oil instead of the stale local bottle."
  }
]